# Game over - версия 2
# Показывает разные приемы работы со строками
print("Программа'Game over' 2.0")
print("То же", " самое", " сообщение")
print("Только",
      "чуть-чуть",
      "побольше")
print("Вот", end=" ")
print("оно...")
print(
    r"""

     _____        ____       ___  ___   ____
    /  ___|      /    |     /   |/   | |  __|
    | |         / / | |    / /|   /| | | |__
    | |  _     / ____ |   / / |__/ | | |  __|
    | |_| |   / /   | |  / /       | | | |__
    \_____/  /_/    |_| /_/        |_| |____|

     _____    _     _   ____   _____
    /  _  \  | |   / / |  __| |  _  \
    | | | |  | |  / /  | |__  | |_| |
    | | | |  | | / /   |  __| |  _  /
    | |_| |  | |/ /    | |__  | | \ \
    \_____/  |___/     |____| |_|  \_\
    """
)
input("\n\nНажмите Enter. Что бы выйти.")
